[M_NameGame MissionDefinition]
MissionDescription="Sir Hammerlock isn't happy with the name ''bullymong'' and would like you to help him come up with a better name for the species before he publishes his almanac of Pandora's wildlife. He's asked you to head to [place]Three Horns Divide[-place] and examine the bullymongs (using violence, of course) so he may study them and come up with a better name."
TeaserText="''Bullymong'' sounds kind of silly -- Hammerlock needs you to help him come up with something that sounds cooler."

[M_NameGame:KillGrenade MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock isn't happy with the name ''bullymong'' and would like you to help him come up with a better name for the species before he publishes his almanac of Pandora's wildlife. He's asked you to head to [place]Three Horns Divide[-place] and examine the bullymongs (using violence, of course) so he may study them and come up with a better name After examining a few bullymong piles, Hammerlock decided that ''primal beast'' might be a better name. He's asked you to try the new name out by killing a primal beast with a grenade."

[M_NameGame:KillMoreObjSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock isn't happy with the name ''bullymong'' and would like you to help him come up with a better name for the species before he publishes his almanac of Pandora's wildlife. He's asked you to head to [place]Three Horns Divide[-place] and examine the bullymongs (using violence, of course) so he may study them and come up with a better name After failing to rename the bullymongs two separate times, Hammerlock has thrown up his hands and decided to name them ''bonerfarts.'' He's asked you to kill a few for him."

[M_NameGame:ShootprojectilesObjSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock isn't happy with the name ''bullymong'' and would like you to help him come up with a better name for the species before he publishes his almanac of Pandora's wildlife. He's asked you to head to [place]Three Horns Divide[-place] and examine the bullymongs (using violence, of course) so he may study them and come up with a better name Hammerlock tried to call the bullymongs ''primal beasts,'' but his publishers hated the name. He's tried to rename the creatures ''ferovores,'' and has asked you to try out the new name by shooting some of their projectiles out of the air."
